{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "112"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "74"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_7_1/conv2d_44_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_45_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_46_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_47_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_48_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_49_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_50_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_51_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_52_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_53_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_54_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/dense_8_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/dense_9_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "74"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/dense_9_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "74"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "112"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_44_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/Cast", "StatefulPartitionedCall/functional_7_1/conv2d_44_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_44_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_52_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_52_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_53_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_45_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_53_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_45_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_45_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_54_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_46_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_54_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_46_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_46_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_55_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_47_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_55_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_47_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_47_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_56_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_48_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_56_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_48_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_48_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_57_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_49_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_57_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_49_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_49_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_58_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_50_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_58_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_50_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_50_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_59_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_51_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_59_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_51_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_51_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_60_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_52_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_60_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_52_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_52_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_61_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_53_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_61_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_53_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_53_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_62_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_54_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_62_1/Relu", "StatefulPartitionedCall/functional_7_1/conv2d_54_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/conv2d_54_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_63_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_63_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Cast", "StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Mean"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Cast_1"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/Cast", "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/re_lu_64_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_7_1/dense_8_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_7_1/re_lu_64_1/Relu", "StatefulPartitionedCall/functional_7_1/dense_8_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_7_1/dense_8_1/MatMul"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_7_1/dense_9_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_7_1/Cast_1", "StatefulPartitionedCall/functional_7_1/dense_9_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_7_1/dense_9_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_7_1/dense_9_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_7_1/dense_9_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_7_1/dense_9_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_7_1/conv2d_44_1/convolution/Cast", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_52_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_53_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_45_1/convolution/Cast", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_54_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_46_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_55_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_47_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_56_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_48_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_57_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_49_1/convolution/Cast", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_58_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_50_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_59_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_51_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_60_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_52_1/convolution/Cast", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_61_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_53_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_62_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/conv2d_54_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_63_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/global_average_pooling2d_4_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/batch_normalization_64_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/dense_8_1/Cast/Cast", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/dense_9_1/Cast/ReadVariableOp", "shape": [128, 74], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_7_1/dense_9_1/BiasAdd/ReadVariableOp", "shape": [74], "dtype": "float32"}]}]}