{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "112"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "74"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_5_1/conv2d_22_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_23_1/convolution/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_24_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_25_1/convolution/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_26_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_27_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_28_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_29_1/convolution/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_30_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_31_1/convolution/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_32_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_4_1/Cast/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "74"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "74"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "112"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_HALF"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_22_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/Cast", "StatefulPartitionedCall/functional_5_1/conv2d_22_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_HALF"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_22_1/convolution"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_26_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_26_1/Relu"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_HALF"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_27_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_23_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_27_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_23_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_23_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/add_1"], "attr": {"DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_28_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_24_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_28_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_24_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_24_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_29_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_25_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_29_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_25_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_25_1/convolution"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_30_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_26_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_30_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_26_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_26_1/convolution"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_HALF"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_31_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_27_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_31_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_27_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_27_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_32_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_28_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_32_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_28_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_28_1/convolution"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_33_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_29_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_33_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_29_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_29_1/convolution"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/add_1"], "attr": {"DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_34_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_30_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_34_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_30_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_30_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_35_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_31_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_35_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_31_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_31_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/add_1"], "attr": {"DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_36_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_32_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_36_1/Relu", "StatefulPartitionedCall/functional_5_1/conv2d_32_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/conv2d_32_1/convolution"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_37_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_37_1/Relu"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Cast", "StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Mean"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Cast_1"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/Cast", "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/add_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/re_lu_38_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_4_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_5_1/re_lu_38_1/Relu", "StatefulPartitionedCall/functional_5_1/dense_4_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_b": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_HALF"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_5_1/dense_4_1/MatMul"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_5_1/Cast_1", "StatefulPartitionedCall/functional_5_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_5_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_5_1/dense_5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_5_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_5_1/conv2d_22_1/convolution/Cast", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_26_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_27_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_23_1/convolution/Cast", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_28_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_24_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_29_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_25_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_30_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_26_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_31_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_27_1/convolution/Cast", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_32_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_28_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_33_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_29_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_34_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_30_1/convolution/Cast", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_35_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_31_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_36_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv2d_32_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_37_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/global_average_pooling2d_2_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/batch_normalization_38_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/dense_4_1/Cast/Cast", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Cast/ReadVariableOp", "shape": [128, 74], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [74], "dtype": "float32"}]}]}